cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle' # To be able to use run `brew bundle` to install all apps

# Binaries
brew 'git'
brew 'coreutils'
brew 'bash' # Latest Bash version
brew 'bat' # Improved cat command
brew 'eza' # Improved ls command
brew 'zoxide' # Improved cd command
brew 'wget' # Download files from the web
brew 'mas' # Mac App Store manager
brew 'direnv' # Load/unload environment variables based on current directory
brew 'ffmpeg' # VM OFF -
brew 'parallel'
brew 'nushell'
brew 'zellij'
brew 'jq'
# brew 'fd'
# brew 'tor'
# brew 'keycastr'

brew 'python'
# brew 'rust'
brew 'fzf'
brew 'lazygit'
brew 'neovim'
brew 'ripgrep'
brew 'stow'
# brew 'mitmproxy'
brew 'docker' # VM OFF -
brew 'docker-compose' # VM OFF -
# brew 'carapace'
# brew ansible

# Apps
cask 'font-hack-nerd-font'
cask 'bruno'
cask 'twingate'
cask 'figma'
cask 'ghostty'
# cask 'wezterm' # VM OFF
cask 'raycast'
cask 'zed'
cask 'clop' # VM OFF - Image, video optimiser
cask 'iina' # VM OFF - Video player
cask 'keka' # File archiver
cask 'podman-desktop' # VM OFF
cask 'spotify' # VM OFF
cask 'hyperkey' # VM OFF
cask 'hammerspoon' # VM ONLY
cask 'lulu' # VM ONLY - Security - Open-source firewall to block unknown outgoing connections
cask 'knockknock' # Security - Tool to show what is persistently installed on the computer
cask 'reikey' # Security - Scans, detects, and monitors keyboard taps
cask 'discord' # VM OFF -
cask 'notion' # VM OFF -
cask 'transmission' # VM OFF -
cask 'tor-browser' # VM OFF -
cask 'localsend' # VM OFF - Open-source alternative to AirDrop
cask 'telegram' # VM OFF -
# cask 'visual-studio-code'

# Download App Store apps with mas
#mas 'Twingate', id: 1501592214 # VM OFF - Twingate
mas 'WireGuard', id: 1451685025 # VM OFF - WireGuard
mas 'PDFgear: PDF Editor & Reader', id: 6469021132 # VM OFF - PDFgear
mas 'Dropover - Easier Drag & Drop', id: 1355679052 # VM OFF - Dropover
